---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPattern.PatternAngle
source: html/7bd20cb6-6c91-ba6b-9f9c-7fb5c4e20055.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.PatternAngle Property

The angle between neighboring railing segments which conditions breaking patterns distribution along a railing path.

## Syntax (C#)
```csharp
public double PatternAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for patternAngle is not finite